scripts/benchmark-results/20260703T185035Z_graalvm-native-pets.txt
label: graalvm-native-image-pets
endpoint: /pets
duration_s: 30
concurrency: 20
cgroup: --cpus=0.5 --memory=1024m (ECS Fargate equivalent)
binary: backend/build/native/nativeCompile/adoptu-backend (134MB, built from adoptu HEAD e503b29 + this branch's native-image work)
---
Running 30s test @ http://host.docker.internal:18099/pets
  20 threads and 20 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   172.93ms  135.30ms   1.00s    81.83%
    Req/Sec     8.04      4.42    30.00     76.74%
  Latency Distribution
     50%  104.36ms
     75%  206.67ms
     90%  323.08ms
     99%  737.69ms
  3846 requests in 30.10s, 41.78MB read
Requests/sec:    127.79
Transfer/sec:      1.39MB
--- container memory samples during load (CPU% MemUsage MemPerc) ---
51.06% 105.3MiB / 1GiB 10.28%
50.50% 110.5MiB / 1GiB 10.79%
50.32% 109.8MiB / 1GiB 10.72%
51.62% 109.1MiB / 1GiB 10.65%
52.82% 107.8MiB / 1GiB 10.53%
50.43% 110.2MiB / 1GiB 10.76%
51.74% 111.1MiB / 1GiB 10.85%
50.81% 107.4MiB / 1GiB 10.49%
50.99% 106.3MiB / 1GiB 10.38%
0.57% 61.85MiB / 1GiB 6.04%
0.18% 61.83MiB / 1GiB 6.04%
0.10% 61.83MiB / 1GiB 6.04%
0.07% 61.83MiB / 1GiB 6.04%
0.10% 61.83MiB / 1GiB 6.04%
0.14% 61.83MiB / 1GiB 6.04%
0.08% 62.8MiB / 1GiB 6.13%
0.13% 62.8MiB / 1GiB 6.13%
0.09% 62.8MiB / 1GiB 6.13%
0.09% 62.92MiB / 1GiB 6.14%
0.10% 62.92MiB / 1GiB 6.14%